Magnus-Wallesverd/IEEE-Nola-Robotics-2026/stm32flash/src/OS.c
#include "stm32f303.h"
#include <stdint.h>
#include "math.h"

uint32_t global_tick = 0;
uint32_t  task_flag = 0;
TCB _stcb[TCB_ARRAY_SIZE];
TCB *current_tcb;
TCB *next_tcb;


uint32_t get_global_tick(void){
    return global_tick;
}

void tcbinit(void){

    for(int i = 0; i < TCB_ARRAY_SIZE; i++){
        _stcb[i].total_age = 0;
        _stcb[i].queue_age = 0;
        _stcb[i].pid = i;
        _stcb[i].state = READY;
        _stcb[i].prio = 0x0;
        _stcb[i].flags = 0x0;
    }
}

void worker_function(void){
    
    work_item_t* item;
    
    // take item off queue
    current_tcb->state = RUNNING;
    if(lock(&task_flag) == 1){
        item = (work_item_t*)dequeue(task_queue_ptr);
        unlock(&task_flag);
    } else { yield(); }
    
    if(item == (void*)0){
        current_tcb->state = IDLE;
        yield();
        return;
    } else {
        item->fn(item->args);
        current_tcb->state = READY;
        yield();
    }
}

void my_thread1(void *ctx){
    (void)ctx;
    while(1){
        worker_function();
    }
}

void my_thread2(void *ctx){
    (void)ctx;
    while(1){
        worker_function();
    }
}

void my_thread3(void *ctx){
    (void)ctx;
    while(1){
        worker_function(); 
    }
}

void my_thread4(void *ctx){
    (void)ctx;
    while(1){
        worker_function();
    }
}

void my_thread5(void *ctx){
    (void)ctx;
    while(1){
        worker_function();
    }
}

void my_thread6(void *ctx){
    (void)ctx;
    while(1){
        worker_function();
    }
}

void my_thread7(void *ctx){
    (void)ctx;
    while(1){
        worker_function();
    }
}

void my_thread8(void *ctx){
    (void)ctx;
    while(1){
        worker_function();
    }
}

void my_thread9(void *ctx){
    (void)ctx;
    while(1){
        worker_function();
    }
}

void my_thread10(void *ctx){
    (void)ctx;
    while(1){
        worker_function();
    }
}

TCB* threadscheduler(void){
    if(ready_queue_ptr->count > 0){
        next_tcb = dequeue(ready_queue_ptr);
    } else if(current_tcb->state == BLOCKED){
        next_tcb = (TCB*)dequeue(running_queue_ptr);
    } else if(current_tcb->state == RUNNING){
        enqueue(running_queue_ptr, current_tcb);
        next_tcb = (TCB*)dequeue(running_queue_ptr);
    } else {
        while(1);
    }
    if(next_tcb == 0){
        __asm volatile("BKPT #0"); // scheduler error
        while(1);
    }

    return next_tcb;
}

